{"Daily-Notes/index":{"title":"Daily Notes","links":[],"tags":[],"content":""},"Miscellaneous/Recommended-Blogs":{"title":"Recommended Blogs","links":["tags/ai","tags/math","tags/general"],"tags":["ai","math","general"],"content":"Here are some blogs I have found to be helpful and inspiring, from homework to research and everything in between. This list keeps on updating regularly.\nai\n\nLil’Log\ninFERENCe\nDeep (Learning) Focus\narg min\nDavid Stutz\nJack Morris\nICLR Blogposts Track\nDistill\ncolah\nRylan Schaeffer\nCoconut Mode\n\nmath\n\nTerence Tao (Helped me for my probability take-home exams/assignments 🫡)\nAlmost Sure\nShtetl-Optimized\nNot Even Wrong\n\ngeneral\n\nAndy Matuschak\nNeel Nanda (general advice and mechanistic interpretability)\n"},"Miscellaneous/Resources":{"title":"Resources","links":[],"tags":[],"content":"Basics\nLearning the Shell"},"Miscellaneous/index":{"title":"Miscellaneous","links":[],"tags":[],"content":""},"Paper-Reading/SimCLR":{"title":"SimCLR","links":[],"tags":[],"content":"Testing!\nThis is yet another test for broken links in Quartz."},"Paper-Reading/index":{"title":"Reading Notes","links":[],"tags":[],"content":""},"index":{"title":"Home","links":["Miscellaneous/Recommended-Blogs"],"tags":[],"content":"Akash SharmaMS (Research) Student, EE @ IIT Madras\nI’m currently a master’s graduate student at Department of Electrical Engineering at Indian Institute of Technology Madras. I am advised by Dr. Mohanasankar Sivaprakasam and Keerthi Ram. I am also a part of the analytics team at Sudha Gopalakrishnan Brain Centre, IIT Madras. My broad research interests include fundamental deep learning (theory and application) for both vision and language tasks.\nResearch\nFor my master’s thesis, I am working on learning better representations for improving performance on long-tailed data for a variety of tasks including image classification and segmentation in supervised and self-supervised learning regimes.\nDuring my time at IIT Madras, I have also explored model calibration methods such as conformal prediction and posterior re-calibration for improving segmentation accuracy for under-represented classes in medical images, temporal graph learning for predictive disease modeling and cell instance segmentation.\nOpen Research Efforts\nI am also involved in developing natively multimodal (text and audio) models with Dr. Gaurav Aggarwal and Tensoic.\nContact\nI am always excited to discuss/collaborate on anything ML, math and computing. The best way to reach out to me is via email but you can also find me on other platforms, please see bottom of this page.\nNews\nI think by writing and find it extremely helpful to understand complex topics. I plan to write blogs for what I am working on and learn, on a regular basis, look forward to exciting longform blogs coming up soon! Till then, here is a list of some Recommended Blogs."}}